Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: དེ་དེར་ལོ་དྲུག་གི་བར་དུ་དཀའ་བ་སྤྱད་ནས་སེ་རི་ཀའི་གྲོང་མིའི་བུ་མོ་དགའ་མོ་དང་དགའ་སྟོབས་ལས་འོ་མ་ལན་བཅུ་དྲུག་ཏུ་ཉིང་གུར་བྱས་པའི་འོ་ཐུག་སྦྲང་རྩི་དང་སྦྱར་བ་བཞེས་སོ། །
en: After practicing austerities there for six years, from the young women Nandā and Nandabalā of Serika village he accepted honeyed porridge prepared from milk that had been made into cream sixteen times over.

source: དེ་ནས་རྩྭ་འཚོང་བཀྲ་ཤིས་ལྡན་ལས་རྩྭ་བཞེས་སོ། །
en: Then he accepted grass from Svastika the grass peddler.

source: དེ་ནས་ཀླུའི་རྒྱལ་པོ་ནག་པོས་མངོན་པར་བསྟོད་ཅིང་བྱང་ཆུབ་ཀྱི་སྙིང་པོར་གཤེགས་ཏེ།
en: Then the nāga king Kāla praised him highly, and he proceeded to Bodhimaṇḍa.

source: ཉིད་ཀྱིས་རྩྭ་རྣམས་མ་འཁྲུགས་པར་བཏིང་ནས། སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་བཞུགས་ནས།
en: There he laid the grass out smooth, sat down cross-legged, and made a firm commitment to himself:

source: ནམ་བླ་ན་མེད་པའི་ཡེ་ཤེས་མ་ཐོབ་ཀྱི་བར་དུ་སྐྱིལ་མོ་ཀྲུང་མི་བཤིག་གོ་ཞེས་ཐུགས་དམ་བརྟན་པོར་བསམས་སོ། །
en: “Until such time as I attain the highest wisdom,” he thought, “I shall not give up this cross-legged posture.”

source: དེས་དེར་བདུད་ཀྱི་འཁོར་འབྱུང་པོ་བྱེ་བ་ཕྲག་སུམ་ཅུ་རྩ་དྲུག་བཅོམ་ནས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་ཡེ་ཤེས་བརྙེས་སོ། །
en: On that spot, he conquered the thirty-six million beings of Māra’s retinue and achieved unexcelled, total, and complete wisdom.

source: དེ་ནས་ཚངས་པས་བསྐུལ་ནས་བཱ་རཱ་ཎ་སཱིར་ལན་གསུམ་དུ་བཟླས་ཏེ། རྣམ་པ་བཅུ་གཉིས་སུ་ཆོས་ཀྱི་འཁོར་ལོ་ཚུལ་བཞིན་བསྐོར་ཏེ་ལྔ་སྡེ་རྣམས་རབ་ཏུ་ཕྱུང་ངོ་། །
en: Then, beseeched by Brahmā three times, he enumerated the four truths of the noble ones three times in Vārāṇasī,

source: དེ་ནས་ཉེ་བའི་ལྔ་སྡེ་རྣམས་དང་བཟང་སྡེའི་ཕ་ཚན་པ་དྲུག་ཅུ་དང་གྲོང་གི་བྱིས་པ་གཙོ་བོའི་མཆོག་ལྔ་བཅུ་དང་དགའ་མོ་དང་དགའ་སྟོབས་སྤུན་གཉིས་བདེན་པ་ལ་བཀོད་ནསལྟེང་རྒྱས་འོད་སྲུང་དང་ཆུ་ཀླུང་འོད་སྲུང་སྤུན་གཉིས་རབ་ཏུ་ཕྱུང་སྟེ་ག་ཡཱར་གཤེགས་ནས།
en: properly setting in motion the wheel of the Dharma in its twelve aspects, and led the group of five to go forth. After he had established another five in the truths, as well as a party of sixty fathers, the sons of fifty village chieftains, and the two siblings Nandā and Nandabalā, he led the brothers Uruvilvā Kāśyapa and Nadī Kāśyapa to go forth and traveled on to Gayā.

source: ཆོ་འཕྲུལ་རྣམ་པ་གསུམ་གྱིས་བཏུལ་ཏེ་སྨྱིག་མའི་ནགས་ཁྲོད་དུ་གཤེགས་ནས་ རྒྱལ་པོ་གཟུགས་ཅན་སྙིང་པོ་ལྷ་བརྒྱད་ཁྲི་དང་ཡུལ་མ་ག་དྷཱའི་བྲམ་ཟེ་དང་། ཁྱིམ་བདག་སྟོང་ཕྲག་དུ་མ་དང་ལྷན་ཅིག་ཏུ་བདེན་པ་ལ་བཀོད་དོ། །
en: He tamed others with three types of miraculous displays, traveling to the Forest of Reeds, where he established in the truths King Bimbisāra, eight thousand gods, and the hundreds and hundreds of brahmins and householders of Magadha.

source: དེ་ནས་རྒྱལ་པོའི་ཁབ་ཏུ་གཤེགས་ཏེ། འོད་མའི་ཚལ་བཞེས་ནས་དགེ་སློང་ཤཱ་རིའི་བུ་དང་མཽད་གལ་གྱི་བུ་གཉིས་རབ་ཏུ་ཕྱུང་སྟེ་མཉན་དུ་ཡོད་པར་གཤེགས་ནས།
en: Then he went to Rājagṛha, where he accepted the gift of Bamboo Grove, and led Śāriputra and Maudgalyāyana to go forth.

source: རྒྱལ་པོ་གསལ་རྒྱལ་གཞོན་ནུ་ལྟ་བུའི་མདོ་སྡེས་བཏུལ་ཏེ། རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་བཞེས་ནས་སེར་སྐྱའི་གནས་སུ་གཤེགས་ཏེ། ཡབ་སྲས་མཇལ་ནས་སེར་སྐྱའི་གནས་སུ་རྟེན་བཅས་ཏེ། གདུལ་བར་བྱ་བ་རྣམས་ཀྱི་དོན་མཛད་ཅིང་བཞུགས་སོ། །
en: He proceeded to Śrāvastī, subjugated King Prasenajit through the discourse on “the similes of the young ones,” accepted the gift of the garden of Prince Jeta, and went to stay in Kapilavastu, where he was reunited with his father and son. With support from Kapilavastu he lived on to act for the benefit of those to be tamed.

source: དེ་ནས་ཁ་ལོ་པ་རབ་བཟང་གི་སེམས་སྐྱེས་པ།
en: Thereupon the thought occurred to Subhadra ,

source: བདག་ནི་ད་ལྟར་བུ་མེད་དེ་བདག་ཤི་སྟེ་དུས་ལས་འདས་ན་ནི། ཅི་བདོག་པ་ཐམས་ཅད་རྒྱལ་པོ་དབང་བྱེད་པར་འགྱུར་གྱིས།
en: “Seeing as I have no heir, after I die all I have will become the king’s property.

source: མ་ལ་བདག་གིས་འཇིག་རྟེན་ཕ་རོལ་ཏུ་བསྐྱ་བར་བྱའོ་སྙམ་ནས
en: I will bring it to bear on my next life.”

source: དེས་ཕྱི་དེ་ཉིན་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་བཤོས་ལ་སྤྱན་དྲངས་ཏེ། རང་གི་ལག་ནས་བཟའ་བ་དང་བཅའ་བ་གཙང་མ་བཟང་པོ་མང་པོས་ཚིམ་པར་བྱས་ཏེ་ཅི་བཞེད་པ་བསྟབས་ནས།
en: So the next day he invited the Buddha and the rest of the saṅgha of monks for a meal and with his own hands contented them with many good, wholesome foods, proffering all that they wished.

source: བསྩང་སྡེར་ནི་གྱུ་ཕྱག་ནི་བཅབས་པར་རིག་ནས། སྟན་ཆེས་དམའ་བ་ཞིག་བླངས་ཏེ་ཆོས་མཉན་པའི་ཕྱིར་སྤྱན་སྔར་འདུག་གོ། །
en: Once he knew that their bowls had been taken away and their hands washed, he brought in a very low seat and sat before the Blessed One to listen to the Dharma.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལ་ཆོས་ཀྱི་གཏམ་གྱིས་ཡང་དག་པར་བསྟན། ཡང་དག་པར་འཛིན་དུ་བཅུག །ཡང་དག་པར་གཟེངས་བསྟོད། ཡང་དག་པར་དགའ་བར་མཛད་དེ། ཆོས་ཀྱི་གཏམ་རྣམ་གྲངས་དུ་མས་ཡང་དག་པར་བསྟན།
en: The Blessed One instructed, encouraged, inspired, and delighted him with a discourse on the Dharma.

source: ཡང་དག་པར་འཛིན་དུ་བཅུག །ཡང་དག་པར་གཟེངས་བསྟོད། ཡང་དག་པར་དགའ་བར་མཛད་ནས། ཅང་མི་གསུང་བར་བཞུགས་སོ། །
en: Once he had instructed, encouraged, inspired, and delighted him with a great variety of Dharma discourses, he sat there silently.

source: དེ་ནས་ཁ་ལོ་པ་རབ་བཟང་གིས་བཅོམ་ལྡན་འདས་ཀྱི་གཏམ་གྱི་མཇུག་རྫོགས་པར་རིག་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Knowing that the Blessed One had completed his discourse, the charioteer Subhadra said to the Blessed One,

source: བཙུན་པ་འདི་ནི་བདག་གི་ཡུན་རིང་པོའི་སྟོན་པ་ལགས་ཏེ།
en: “Lord, you will be my teacher for a long time.

source: ཀྱེ་མ་བདག་ལ་བུ་ཞིག་སྐྱེས་ན་ནི། ཇི་ལྟར་བདག་རྒྱལ་པོ་ཟས་གཙང་གི་ཁ་ལོ་པ་འཚལ་བ་དེ་བཞིན་དུ། དེ་ཡང་གཞོན་ནུའི་ཁ་ལོ་པར་འགྱུར་བ་ཞིག་ན།
en: If I’d had a son, he would have been charioteer to you, the prince, just as I have been charioteer to King Śuddhodana.

source: ད་ནི་བཅོམ་ལྡན་འདས་ལ་རབ་ཏུ་ཕྱུང་སྟེ། དེ་ལྟར་གྱུར་གྱིས་ཀྱང་གལ་ཏེ་ད་དུང་ཡང་བདག་གི་བུ་ཞིག་བྱུང་ན་ནི། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་འབྲིང་དུ་དབུལ་བར་འཚལ་ལོ། །
en: Now the Blessed One has gone forth, but if I have a son, I shall offer him to the Blessed One as an attendant just the same.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་མ་འོངས་པའི་ཡོན་ཏན་གཟིགས་ནས་བཀའ་སྩལ་པ།
en: The Blessed One saw the good it would bring and said,

source: ཁོང་དགེ་བ་རྣམས་ནི་དམ་བཅས་པ་ལ་བརྟན་པ་ཡིན་ནོ་ཞེས་གསུངས་ནས།
en: “The virtuous keep their promises.”

source: དེའི་ཁྱིམ་ནས་བཅོམ་ལྡན་འདས་སླར་གཤེགས་སོ། །
en: Then he left the house, and returned whence he came.

source: དེ་ནས་ཕྱི་ཞིག་ན་ཁ་ལོ་པ་རབ་བཟང་གི་ཆུང་མ་ལ་བུ་ཆགས་ནས། དེ་ཟླ་བ་དགུའམ་བཅུ་ལོན་པ་དང་བུ་བཙས་ཏེ་ཁྱེའུ་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པ་ཞིག་བཙས་ནས་དེའི་བཙས་སྟོན་རྒྱས་པར་བྱས་ཏེ།
en: One day, the charioteer Subhadra ’s wife finally conceived, and after nine or ten months had passed, she gave birth to a child who was well proportioned, pleasing to the eye, and beautiful. At the elaborate feast celebrating his birth they asked,

source: ཁྱེའུ་འདི་རབ་བཟང་གི་བུ་ཡིན་པས་ན། ཁྱེའུ་འདིའི་མིང་བཟང་པོ་ཞེས་གདགས་སོ་ཟེར་རོ། །
en: “Since he is Subhadra ’s child, his name will be Bhadra.”

source: དེ་ནས་ཁྱེའུ་བཟང་པོ་འོ་མ་དང་། ཞོ་དང་། མར་དང་། ཞུན་མར་དང་། མར་གྱི་ཉིང་གུ་རྣམས་ཀྱིས་བསྐྱེད་བསྲིངས་ནས་དེ་མཚོའི་ནང་གི་པད་མ་བཞིན་དུ་སྐྱེ་དྲག་པར་གྱུར་ཏོ། །
en: They reared him on milk, yogurt, butter, ghee, and milk solids, and he flourished like a lotus in a lake.

source: དེ་ནས་དེ་དག་གང་གི་ཚེ་ཆེར་སྐྱེས་པ་དེའི་ཚེ། ཡི་གེ་དང་། ཁོང་རྩིས་དང་། ཤོད་དགོད་པ་དང་། ལག་རྩིས་དང་། དབྱུང་བ་དང་། སྦ་བ་དང་། དགྲམ་པ་དང་། གོས་བརྟག་པ་དང་། ནོར་བུ་བརྟག་པ་དང་། རིན་པོ་ཆེ་བརྟག་པ་དང་། སྤོས་བརྟག་པ་དང་། སྨན་བརྟག་པ་དང་། གླང་པོ་ཆེ་བརྟག་པ་དང་། རྟ་བརྟག་པ་དང་། གོ་མཚོན་བརྟག་པ་བསླབས་ཏེ།
en: As he grew up he studied letters, tallying, and arithmetic; the study of seals, lending, deposits, and commerce; and the examination of cloth, jewels, gems, incense, medicine, elephants, horses, and arms and armor.

source: དེ་ནས་ཕྱི་ཞིག་ན། བཅོམ་ལྡན་འདས་ཀྱིས་ཁྱེའུ་དེ་རབ་ཏུ་འབྱུང་བའི་དུས་ལ་བབ་པར་གཟིགས་ནས། ཁ་ལོ་པ་རབ་བཟང་ལ་བཀའ་སྩལ་པ་རབ་བཟང་ཁྱེའུ་འདི་ནི་མ་བཙས་པའི་སྔ་རོལ་ནས་ཁྱོད་ཀྱིས་ང་ལ་ཕུལ་ཏེ།
en: One day, the Blessed One saw that the time had come for the young man to go forth, so he reminded the charioteer Subhadra , “ Subhadra , before this child was born you offered him to me.

source: ཁོང་དགེ་བ་རྣམས་ནི་དམ་བཅས་པ་ལ་བརྟན་པ་ཡིན་ན་
en: The virtuous keep their promises, do they not?

source: རབ་བཟང་གིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ཁོ་ན་ལྟར་དམ་བཅས་ལགས་སོ་ཞེས་
en: “Yes, Blessed One,” Subhadra replied, “I did make just such a promise.”

source: གསོལ་ནསརབ་བཟང་གིས་ཁྱེའུ་དེ་ལག་པ་གཉིས་ཀྱིས་བཟུང་སྟེ། བཅོམ་ལྡན་འདས་ལ་ཕུལ་ནས། སྨྲས་པ་
en: As he said this, he took the child by his two hands, offered him to the Blessed One, and told him,

source: བུ་ཁྱོད་མ་བཙས་པའི་སྔ་རོལ་ནས་ངས་བཅོམ་ལྡན་འདས་ལ་ཕུལ་གྱིས།
en: “Child, before you were born, I offered you to the Blessed One.

source: སོང་ལ་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་འབྲིང་གྱིས་ཤིག །
en: Therefore go, and be an attendant of the Blessed One.”

source: ཁྱེའུས་སྨྲས་པ། དེ་ནི་བདག་ལ་ཕན་བཏགས་པ་ལགས་སོ་ཞེས་སྨྲས་ནསཁྱེའུ་དེ་བཅོམ་ལྡན་འདས་ཀྱི་ཕྱི་བཞིན་སོང་ངོ་། །
en: “This will be of benefit to me,” the child said, and with those words he followed the Blessed One away.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཁ་ལོ་པ་རབ་བཟང་ལ་ཆོས་ཀྱི་གཏམ་གྱིས་ཡང་དག་པར་བསྟན། ཡང་དག་པར་འཛིན་དུ་བཅུག །ཡང་དག་པར་གཟེངས་བསྟོད། ཡང་དག་པར་དགའ་བར་མཛད་ནས།
en: The Blessed One instructed, encouraged, inspired, and delighted him with a great variety of Dharma teachings.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཁྱེའུ་དེ་ཁྲིད་དེ་གཙུག་ལག་ཁང་དུ་གཤེགས་སོ། །
en: Then the Blessed One led the child away and traveled to the monastery.

source: དེ་དེར་ཁྲིད་ནས། རབ་ཏུ་ཕྱུང་སྟེ་བསྙེན་པར་རྫོགས་པར་མཛད་ནས་དེ་ལ་ལུང་ཡང་ཕོག་གོ། །
en: There, the Blessed One led him to go forth as a novice, conferred on him full ordination, and instructed him.

source: བཅོམ་ལྡན་འདས་ནི་བདག་གི་སྡུག་བསྔལ་དང་ཡིད་མི་བདེ་བ་མང་པོ་སེལ་བར་མཛད་པ་དང་བདེ་བ་དང་ཡིད་བདེ་བ་རྣམ་པ་དུ་མ་སྒྲུབ་པར་མཛད་པ་དང་། སྡིག་པ་མི་དགེ་བའི་ཆོས་རྣམ་པ་དུ་མ་སེལ་བར་མཛད་པ་དང་། དགེ་བའི་ཆོས་རྣམ་པ་དུ་མ་སྒྲུབ་པར་མཛད་པ་ཡིན་ན་
en: “The Blessed One has dispelled so many kinds of suffering and anguish, brought me so many kinds of happiness and bliss, cleared away so many of my sins and nonvirtues, and secured for me such virtues.

source: བདག་གིས་བཅོམ་ལྡན་འདས་ཀྱི་བཀའ་དྲིན་ཇི་ལྟར་བསབ་པར་བྱ་སྙམ་སྟེ
en: How could I repay the kindness of the Blessed One?”

source: དེས་བསམས་པ་སངས་རྒྱས་རྣམས་འཇིག་རྟེན་དུ་འབྱུང་བ་གང་ཡང་རུང་བ་དེ་དག་ཐམས་ཅད་ནི། སེམས་ཅན་ལ་ཕན་པའི་ཕྱིར་འབྱུང་བར་ཟད་ཀྱི།
en: Then he thought, “Anytime a buddha arises in the world, it is only to benefit beings.

source: མ་ལ་བདག་གིས་ཀྱང་སེམས་ཅན་གྱི་དོན་བྱའོ་སྙམ་སྟེ་བདག་གིས་འདུལ་བར་འགྱུར་བ་ལྟ་འགའ་མཆིས་སམ་ཞེས་བསམས་ཏེ
en: So undoubtedly I too should act for the benefit of beings!” Reflecting in this way, he wondered, “Whom might I tame?”

source: དེས་བལྟས་ན་ཐོག་མ་ཁོ་ནར་ཕ་མ་གཉིས་འདུལ་བར་འགྱུར་བར་རིག་ནས་དེ་གཙུག་ལག་ཁང་ནས་མི་སྣང་བར་གྱུར་ཏེ།
en: When he looked out, right away he saw he could tame his own parents. So he disappeared from the monastery,

source: བདག་གི་ཁྱིམ་དུ་ཕ་མ་གཉིས་ཀྱི་མདུན་ནས་ས་བརྟོལ་ཏེ་བྱུང་ནས་དེ་ངང་པའི་རྒྱལ་པོ་འདབ་མ་བརྐྱང་བ་ལྟར་སྟེང་གི་ནམ་མཁའ་ལ་འཕགས་ནས། ཕ་མ་གཉིས་ཀྱི་མདུན་དུ་འབར་བ་དང་ལམ་མེར་འདུག་པ་དང་ཆར་འབབ་པ་དང་གློག་འགྱུ་བའི་ཆོ་འཕྲུལ་རྣམས་བསྟན་ནས་ས་ལ་བབས་ཏེ།
en: and burst forth right in front of them from the floor of their house. Like a regal swan spreading its wings before them, he rose into the sky, making a miraculous display of fire and light, rain and lightning, and descended to the earth.

source: དེས་ཕ་མ་གཉིས་ཀྱི་བསམ་པ་དང་བག་ལ་ཉལ་དང་ཁམས་དང་ཤེས་པ་དང་རང་བཞིན་རྟོགས་ནས་དེ་དང་འཐུན་པའི་ཆོས་བསྟན་ཏེ།
en: He directly apprehended their thoughts, habitual tendencies, temperaments, capacities, and natures, and taught them the Dharma accordingly.

source: དེ་ཐོས་ནས་ཕ་མ་གཉིས་སྟན་དེ་ཁོ་ན་ལ་འདུག་བཞིན་དུ། འཇིག་ཚོགས་ལ་ལྟ་བའི་རིའི་རྩེ་མོ་མཐོན་པོ་ཉི་ཤུ་ཡེ་ཤེས་རྡོ་རྗེས་བཅོམ་ནས། རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་ཏེ།
en: When they heard it they destroyed with the thunderbolt of wisdom the twenty high peaks of the mountain of views concerning the transitory collection, and manifested the resultant state of stream entry right where they sat.

source: བུ་བདག་ཅག་གཉིས་ཀྱང་ཁྱིམ་ན་གནས་པ་བཏང་ལ། ཁྱོད་རབ་ཏུ་བྱུང་བའི་རྗེས་སུ་རབ་ཏུ་འབྱུང་བར་བྱའོ། །
en: “Child, we are also going to give up living at home and go forth just as you were.”

source: བཟང་པོས་སྨྲས་པ། ཁྱེད་གཉིས་ཇི་ལྟར་དགའ་བ་དེ་བཞིན་དུ་བགྱིའོ་ཞེས་བྱས་ནས། ཚེ་དང་ལྡན་པ་བཟང་པོ་དེ་གཉིས་ཀྱི་ཁྱིམ་ནས་ཕྱིར་སོང་ངོ་། །
en: “As you wish,” Bhadra replied, and he left the house.

source: དེ་ནས་དེའི་ཕ་མ་གཉིས་ཀྱིས་ཁྱིམ་གྱི་འཁོར་བཏང་སྟེ། སྦྱིན་པ་དག་སྦྱིན་ཞིང་བསོད་ནམས་དག་བྱས་ཏེ།
en: Thereupon his parents gave up household affairs, gave gifts, made merit,

source: བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་བརྩོན་པ་དང་བསྒྲུབ་པ་དང་འབད་པས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ནས་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་སོ། །
en: and went forth in the doctrine of the Blessed One. Casting away all afflictive emotions with diligence, practice, and effort, they manifested arhatship.

source: དེ་ནས་དགེ་སློང་རྣམས་ཀྱིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་ཞུས་པ། བཙུན་པ་བཟང་པོས་ལས་ཅི་བགྱིས་ན་ལས་དེའི་རྣམ་པར་སྨིན་པས་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེས་ཏེགཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པར་གྱུར་ནས། བཅོམ་ལྡན་འདས་ཀྱང་མཉེས་པར་བགྱིས་ཏེ། མི་མཉེས་པར་མ་བགྱིས།
en: “Blessed One,” the monks asked, “what action did Bhadra take that ripened into his birth into a family of great means, prosperity, and wealth, and that he pleased the Blessed One, did not displease him,

source: དེའི་ཕ་མ་གཉིས་ཀྱིས་ཀྱང་ལས་ཅི་བགྱིས་ན་ལས་དེའི་རྣམ་པར་སྨིན་པས་འདི་ཁོ་ན་ལས་བརྟེན་ནསབཅོམ་ལྡན་འདས་མཉེས་པར་བགྱིས་ཏེ་མི་མཉེས་པར་མ་བགྱིས།
en: “What actions did his parents take that ripened into their trusting him completely, and that they pleased the Blessed One, did not displease him,

source: བཙུན་པ་འདི་རྣམས་ཀྱིས་སྨོན་ལམ་གང་དུ་བཏབ་པ་ལགས།
en: “Lord, where did they make these prayers?”

source: དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་བསྐལ་པ་བཟང་པོ་འདི་ཉིད་ལ་སྐྱེ་དགུའི་ཚེ་ལོ་བཞི་ཁྲི་ཐུབ་པ་ན། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་གདུལ་བྱའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་འཁོར་བ་འཇིག་ཅེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེདེ་གང་གི་ཚེ་སངས་རྒྱས་ཀྱི་ཕྲིན་ལས་ཐམས་ཅད་མཛད་ནས་ཤིང་ཟད་པའི་མེ་བཞིན་དུ་ཕུང་པོའི་ལྷག་མ་མེད་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་སོ། །
en: “Monks, in times past, in this fortunate eon, when people lived as long as forty thousand years, and the totally and completely awakened buddha possessed of insight and perfect conduct, the sugata, the knower of the world, the tamer of persons, the charioteer, the unsurpassed one, the teacher of humans and gods, the blessed buddha known as Krakucchanda was in the world, he performed all the activities of a buddha and passed beyond all sorrow into the realm of nirvāṇa without any remainder of the aggregates, like a fire when all the wood is gone.

source: དེ་ནས་རྒྱལ་པོ་མཛེས་པས་བཅོམ་ལྡན་འདས་ཀྱི་སྐུ་གདུང་ལ་སྐུ་གདུང་གི་མཆོད་པ་བྱས་ནས། རིན་པོ་ཆེ་སྣ་བཞི་ལས་བྱས་པའི་མཆོད་རྟེན་ཁོ་ར་ཁོར་ཡུག་ཏུ་དཔག་ཚད་གཅིག་ཡོད་ལ་འཕང་དུ་རྒྱང་གྲགས་གཅིག་ཡོད་པ་ཞིག་བརྩིག་པར་བརྩམས་ཏེ།
en: “King Śobha performed a reliquary offering for the Blessed One’s relics and began to cover the stūpa and the entire surrounding area within one mile with four different kinds of jewels.

source: དེས་དེར་བློན་པོ་མ་དད་པ་ཞིག་ལག་དཔོན་དུ་བསྐོས་ནས། བློན་པོ་དེས་བུ་དེ་ལ་སྨྲས་པ་བུ་ངས་ནི་རྒྱལ་པོའི་བསྒྲུབ་པ་དང་རྒྱལ་པོའི་བྱ་བ་དག་བྱ་དགོས་ཏེ།
en: The minister he had appointed to oversee this had no faith, and told his son, ‘My child, I must complete this task on behalf of the king in addition to executing the royal duties.

source: ངས་གཉི་ག་ལག་གིས་མི་ཁྱབ་པའི་སྟེང་དུ། འདི་འབའ་ཞིག་ལ་འཚལ་ན་
en: If I can’t handle both, I shall lose my position at the royal palace.

source: བདག་གིས་རྒྱལ་པོའི་ཕོ་བྲང་དུ་བྱ་བ་རྣམས་ཤོར་བར་འགྱུར་གྱིས། ཁྱོད་ཀྱིས་འདིར་མཆོད་རྟེན་གྱི་ལག་གི་ཞལ་ཏ་གྱིས་ཤིག་དང་ངས་རྒྱལ་པོའི་ཞབས་འབྲིང་བྱའོ། །
en: Therefore, my child, please supervise work on the stūpa, and I shall serve the king.’

source: ཁྱེའུས་སྨྲས་པ། ཡབ་ཇི་ལྟར་དགྱེས་པ་དེ་བཞིན་དུ་བགྱིའོ་ཞེས་བྱས་ནས་དེ་དེ་ན་མཆོད་རྟེན་གྱི་ལག་གི་ཞལ་ཏ་བྱེད་ཅིང་འདུག་སྟེ། དེ་དེར་ལས་བྱེད་པ་ལ་ཞུགས་སོ། །
en: “ ‘As you wish, father,’ the young man said, and he remained there to supervise the work on the stūpa.

source: དེ་དེ་ན་ལས་བྱེད་པ་ན་སངས་རྒྱས་འཁོར་བ་འཇིག་གི་བསྟན་པ་ལ་དད་པ་རྙེད་ནས་སྐྱབས་སུ་འགྲོ་བ་དང་བསླབ་པའི་གཞི་རྣམས་བླངས་སོ། །
en: “He began to work on the stūpa, and as he was working there, he found faith in the doctrine of the Buddha Krakucchanda, so he went for refuge and took the fundamental precepts.

source: དེས་དེར་ཕ་མ་གཉིས་ཀྱང་དད་པ་ཕུན་སུམ་ཚོགས་པ་ལ་བཀོད་དེ།
en: Then he led his parents to live a life of perfect faith

source: སྐྱབས་སུ་འགྲོ་བ་དང་བསླབ་པའི་གཞི་རྣམས་ལ་ཡང་བཀོད་དོ། །
en: and to likewise take refuge and the fundamental precepts.

source: དེར་གང་གི་ཚེ་རྒྱལ་པོ་མཛེས་པས་མཆོད་རྟེན་དེ་རྣམ་པ་ཐམས་ཅད་དུ་ཟིན་པར་བྱས་ནས་མཆོད་པ་ཆེན་པོ་བྱས་ཏེ།
en: “King Śobha completed every aspect of the stūpa and made great offerings to it.

source: མཆོད་རྟེན་གྱི་དུས་སྟོན་གྱི་ལུགས་གཏོད་པ་དེའི་ཚེ། བློན་པོ་དེ་གཟའ་བྲན་དང་བློན་པོའི་བུ་དེས་མཆོད་རྟེན་དེ་རྣམ་པ་ཐམས་ཅད་དུ་ཡོངས་སུ་རྫོགས་པར་མཐོང་ནས་མཆོག་ཏུ་དགའ་བར་གྱུར་ཏེམཆོག་ཏུ་དགའ་བར་གྱུར་ནས་དེ་དག་གིས་མཆོད་རྟེན་དེ་ལ་བཀུར་སྟི་ཆེན་པོ་བྱས་ཏེ།
en: At the beginning of the traditional stūpa festival, the minister, his wife, his servants, and his son were elated to see that every aspect of the stūpa had been completed in full, and they made a large offering to the stūpa.

source: བློན་པོའི་བུ་དེས་མཆོད་རྟེན་གྱི་ཞབས་ལ་ཕྱག་འཚལ་ནས་སྨོན་ལམ་བཏབ་པ།
en: The minister’s son bowed down at the foot of the stūpa and prayed,

source: ཀྱེ་མ་དགེ་བའི་རྩ་བ་འདིས་ན་བདག་གང་དང་གང་དུ་སྐྱེས་པ་དེ་དང་དེར་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེ་བར་ཤོག་ཅིག །
en: ‘By this root of virtue, wherever I am born, may it be into a family of great means, prosperity, and wealth.

source: སྟོན་པ་འདི་འདྲ་བ་མཉེས་པར་བྱེད་པར་གྱུར་ཅིག །མི་མཉེས་པར་བྱེད་པར་མ་གྱུར་ཅིག །
en: May I please and not displease a teacher just like this one.

source: དེ་ནས་ཕ་མ་གཉིས་ཀྱིས་དེ་མཐོང་ནས། བུ་ཁྱོད་ཀྱིས་སྨོན་ལམ་ཇི་སྐད་བཏབ་ཅེས་དྲིས་པ་དང་།
en: “When his parents saw this, they asked, ‘Child, what prayers are you making?’

source: དེས་དེ་གཉིས་ལ་ཐམས་ཅད་རྒྱས་པར་བསྙད་ནས། དེ་ཐོས་མ་ཐག་ཏུ་དེ་གཉིས་ཀྱིས་ཀྱང་སྨོན་ལམ་བཏབ་སྟེ།
en: “He told them everything in detail, and when they heard it, right away they both prayed,

source: ཀྱེ་མ་དགེ་བའི་རྩ་བ་འདིས་ན་བདག་ཅག་གཉིས་ཀྱང་གང་དང་གང་དུ་སྐྱེ་བ་དེ་དང་དེར་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེ་བར་ཤོག་ཅིག །
en: ‘By this root of virtue, wherever we are born, may it be into families of great means, prosperity, and wealth.

source: འདི་ཉིད་བདག་ཅག་གི་བུར་གྱུར་ནས་
en: May he be our son.

source: འདི་ཁོ་ན་ལས་བརྟེན་ཏེ། བདག་ཅག་གཉིས་ཀྱིས་སྟོན་པ་འདི་འདྲ་བ་མཉེས་པར་བྱེད་པར་གྱུར་ཅིག །མི་མཉེས་པར་བྱེད་པར་མ་གྱུར་ཅིག །
en: Entrusting ourselves to him completely, may we please and not displease a teacher just like this one.

source: དེའི་ཚེ་བློན་པོའི་བུར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་བཟང་པོ་འདི་ཁོ་ན་ཡིན་ནོ། །
en: The one who was the minister’s son then is none other than Subhadra .

source: དེའི་ཚེ་ཕ་མར་གྱུར་པ་གང་ཡིན་པ་དེ་གཉིས་ནི་ཕ་མ་འདི་གཉིས་ཁོ་ན་ཡིན་ནོ། །
en: Those who were his parents then are none other than his parents now.

source: དེས་མཆོད་རྟེན་དེ་ལ་བཀུར་སྟི་བྱས་ནས་སྨོན་ལམ་བཏབ་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པས་ནི། གང་དང་གང་དུ་སྐྱེས་པ་དེ་དང་དེར་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེས་ཏེ
en: The act of venerating the stūpa and saying that prayer ripened such that wherever they were born, it was into a family of great means, prosperity, and wealth.

source: དགེ་སློང་དག་ང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འཁོར་བ་འཇིག་དང་ཤིན་ཏུ་མཉམ་པ་དང་། ཤུགས་མཉམ་པ་དང་། མཛད་པ་མཉམ་པ་དང་། ཐབས་མཉམ་པ་བརྙེས་པར་གྱུར་ནས།
en: “So it is, monks, now that I myself have become the very equal of the totally and completely awakened Buddha Krakucchanda—equal in strength, equal in deeds, and equal in skillful means—

source: དེར་ཕ་མ་དེ་གཉིས་ཀྱིས་མཆོད་རྟེན་དེ་ལ་བཀུར་སྟི་བྱས་ནས་སྨོན་ལམ་བཏབ་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པས་ནི་གང་དང་གང་དུ་སྐྱེས་པ་དེ་དང་དེར་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེས་ནས
en: “His parents’ acts of venerating the stūpa and saying that prayer ripened such that wherever they were born, it was into a family of great means, prosperity, and wealth.

source: བུ་འདི་ཁོ་ན་ལས་བརྟེན་ཏེ་འདི་གཉིས་ཀྱིས་ང་མཉེས་པར་བྱས་ཏེ། མི་མཉེས་པར་མ་བྱས་པ་ལ་ང་ཉིད་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་སོ། །
en: By entrusting themselves to their son completely, they have pleased me, not displeased me, gone forth in my very doctrine, cast away all afflictive emotions, and manifested arhatship.

source: གཞན་ཡང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་བསྟན་པ་ལ་ཡང་འདི་གསུམ་ཆར་རབ་ཏུ་བྱུང་སྟེ།
en: “The three of them also went forth in the doctrine of Buddha Kāśyapa.

source: དེར་འདི་རྣམས་ཀྱིས་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་ནས་དབང་པོ་ཡོངས་སུ་སྨིན་པར་བྱས་ཏེ་དེས་ན་ད་ལྟར་རྣམ་པར་གྲོལ་བར་གྱུར་ཏོ།། །།
en: After practicing pure conduct all their lives then, their faculties ripened, and now they have been liberated.”

source: ལྷར་བཅས་ཞེས་བྱ་བ་ནི།
en: The Story of Sahadeva

source: ཡུལ་སེར་སྐྱའི་གནས་ན་རྒྱལ་པོ་སེང་གེ་འགྲམ་ཞེས་བྱ་བ་ནི་རྒྱལ་པོ་བྱེད་དོ། །
en: When King Siṃhahanu reigned in Kapilavastu,

source: ཡུལ་ལྷ་མཐོང་ཞེས་བྱ་བ་ན་ནི་རྒྱལ་པོ་ལེགས་རྟོགས་རྒྱལ་པོ་བྱེད་དེ། དེ་གཉིས་མཛའ་ཞིང་བཤེས་ལ་གཅུགས་པར་གྱུར་ཏོ། །
en: and King Suprabuddha reigned in Devaḍaha, the two were dear friends.

source: དེ་ནས་རྒྱལ་པོ་སེང་གེ་འགྲམ་ཡིད་སྨོན་བྱེད་པ།
en: One day King Siṃhahanu thought,

source: ཀྱེ་མ་བདག་གི་རྒྱུད་དུ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་བྱུང་ན་ཅི་མ་རུང་སྙམ་མོ། །
en: “How wonderful it would be if a universal monarch was born in my lineage!”

source: དེ་ནས་མཐར་གྱིས་དེའི་བུ་བཞི་བྱུང་སྟེ། ཟས་གཙང་དང་བྲེ་བོ་ཟས་དང་བདུད་རྩི་ཟས་དང་ཟས་དཀར་རྣམས་བྱུང་ངོ་། །
en: Subsequently he had four sons named Śuddhodana, Droṇodana, Amṛtodana, and Śuklodana,

source: བུ་མོ་ཡང་བཞི་བྱུང་སྟེ། དག་མ་དང་། བྲེ་མོ་མ་དང་། བདུད་རྩི་མ་དང་། དཀར་མོ་རྣམས་བྱུང་ངོ་། །
en: and four daughters named Śuddhā, Droṇā, Amṛtā, and Śuklā.

source: དེ་ནས་རྒྱལ་པོ་ལེགས་རྟོགས་ཡིད་སྨོན་བྱེད་པ།
en: After that, King Suprabuddha prayed,

source: ཀྱེ་མ་བདག་སེང་གེ་འགྲམ་དང་གཉེན་དུ་གྱུར་ཀྱང་ཅི་མ་རུང་སྙམ་མོ། །
en: “How wonderful it would be to become kin with King Siṃhahanu!”

source: དེ་ནས་དེ་ཡང་བཙུན་མོ་དང་ལྷན་ཅིག་ཏུ་རྩེ་ཞིང་དགའ་ལ་དགའ་མགུར་སྤྱོད་པ་ལས་བུ་བཙས་ཏེ་དེའི་མིང་ལྷར་བཅས་ཞེས་བཏགས་སོ། །
en: He and the queen enjoyed themselves and coupled, she gave birth to a child, and they named him Sahadeva.

source: དེ་ནས་དེ་གང་གི་ཚེ་ཆེར་སྐྱེས་པ་དེའི་ཚེ་ཁྱེའུ་དེ་ཡི་གེ་སློབ་ཏུ་བཅུག་སྟེ། རྒྱལ་རིགས་སྤྱི་བོ་ནས་དབང་བསྐུར་བའི་རྒྱལ་པོ་རྣམས་ཀྱི་བཟོའི་གནས་དང་ལས་ཀྱི་གནས་ཐ་དད་པ་འདི་ལྟ་སྟེ།
en: As the young man grew up, they made him study letters, and trained him in all the different fields of craft and skill in which duly consecrated rulers of the royal caste train, such as

source: གླང་པོ་ཆེ་ཞོན་པ་དང་། རྟ་ཞོན་པ་དང་། མཚོན་ཆ་བཅང་བ་དང་། འཕོང་དང་མདུན་དུ་བསྣུར་བ་དང་། ཕྱིར་བསྣུར་བ་དང་། གཡུལ་ལས་འབྱུང་བར་བྱ་བ་དང་། ལྕགས་ཀྱུ་གཟུང་བ་དང་། ཞགས་པ་གཟུང་བ་དང་། མདའ་བོ་ཆེ་འཕང་བ་དང་། རྡོ་རྗེ་རྩེ་གཅིག་པ་འཕང་བ་དང་། མཚོན་རྩེ་གཅིག་པ་གདབ་པ་དང་། འཁོར་ལོ་འཕང་བ་དང་། གཅད་པ་དང་། གཤེག་པ་དང་། ལག་པས་གཟུང་བ་དང་། རྐང་པའི་སྟབས་དང་། མགོ་བོ་བསྐྱབ་པ་དང་། རྒྱང་མར་འཕང་བ་དང་། སྒྲ་གྲག་པར་འཕང་བ་དང་། གནད་དུ་འཕང་བ་དང་གདོན་མི་ཟ་བར་ཕོག་པར་བྱ་བ་དང་ཚབས་ཆེར་གཏང་བ་རྣམས་ཀྱང་
en: how to ride an elephant, how to ride horseback, how to wield a weapon, and how to shoot an arrow, advance, retreat, wage war, grasp with an iron hook, wield a lasso, shoot a spear, throw a single-pointed vajra, throw other single-pointed weapons, and throw a disk; how to cut, cleave, grapple and hold, employ footwork, guard one’s head, strike from a distance, and strike at the noise of an unseen enemy; and how to target the vital points, take infallible aim, and maximize damage.

source: བསླབས་ནས་གནས་ལྔ་ལ་བྱང་བར་གྱུར་ཏེ་དེ་འདྲ་བའི་ཟླ་གཞན་མེད་དོ། །
en: By the time he had been educated in all of these, he was learned in the five fields of knowledge, and he was without peer.
